#include<stdio.h>
int main()
{
    int a[100]={1,0},b[100]={1,0},c[100]={1,1},n,i;//a下个数，b上个数，c这个数
    for (scanf("%d",&n);n>0;n--){
        for(i=a[0];i>0;i--){
            a[i]=c[i]+b[i];
             if(a[i]/10==1&&i==a[0]){
                a[0]++;//记录该项为几位数，若在最高位发生了进位，就让位数加一
            }
            a[i+1]+=a[i]/10;
            a[i]=a[i]%10;
        }//a=b+c高精度写法,下一个数等与上一个数加上这个数
        for(i=c[0];i>0;i--){
            b[i]=c[i];
        }//c的值给b
        for(i=a[0];i>0;i--){
            c[i]=a[i];
            c[0]=a[0];
        } //a的值给c
    }
     for(i=a[0];i>0;i--){
        printf("%d",a[i]);
    }
}
